In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\saurabh\\Desktop\\pyth\\titanic.csv",usecols = ['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  34.5   7.8292
1         1  47.0   7.0000
2         0  62.0   9.6875
3         0  27.0   8.6625
4         1  22.0  12.2875

In [3]:
import matplotlib.pyplot as plt 
from sklearn.model_selection import train_test_split

In [4]:
df.isnull().sum()

Survived     0
Age         86
Fare         1
dtype: int64

In [5]:
df['Age'].fillna(df['Age'].mean() , inplace = True)
df['Fare'].fillna(df['Fare'].mean() , inplace = True)

In [6]:
df.isnull().sum()

Survived    0
Age         0
Fare        0
dtype: int64

In [8]:
x = df.iloc[: , 1:] 
y = df.iloc[:,0]

In [9]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2)

In [10]:
x_train.head(2)

          Age  Fare
88   30.27259  7.75
155  24.00000  7.55

In [11]:
from sklearn.compose import ColumnTransformer 
from sklearn.preprocessing import KBinsDiscretizer

In [12]:
kbin_Age = KBinsDiscretizer(n_bins = 15 , encode = 'ordinal' , strategy = 'quantile') 
kbin_Age

KBinsDiscretizer(encode='ordinal', n_bins=15)

In [16]:
kbin_Fare = KBinsDiscretizer(n_bins = 15 , encode = 'ordinal', strategy = 'quantile') 
kbin_Fare

KBinsDiscretizer(encode='ordinal', n_bins=15)

In [17]:
trf = ColumnTransformer([
    ('first' , kbin_Age , [0]),
    ('second' , kbin_Fare , [1])
])

In [18]:
trf

ColumnTransformer(transformers=[('first',
                                 KBinsDiscretizer(encode='ordinal', n_bins=15),
                                 [0]),
                                ('second',
                                 KBinsDiscretizer(encode='ordinal', n_bins=15),
                                 [1])])

In [19]:
x_train_trf = trf.fit_transform(x_train) 
x_test_trf = trf.transform(x_test)

C:\Users\saurabh\anaconda3\lib\site-packages\sklearn\preprocessing\_discretization.py:230: UserWarning: Bins whose width are too small (i.e., <= 1e-8) in feature 0 are removed. Consider decreasing the number of bins.
  warnings.warn(

In [21]:
# x_train_trf

In [22]:
trf.named_transformers_['first'].bin_edges_

array([array([ 0.17      , 13.        , 18.        , 21.        , 22.9       ,
              25.        , 27.        , 30.        , 30.27259036, 33.        ,
              39.        , 45.        , 52.6       , 76.        ])            ],
      dtype=object)

In [23]:
output = pd.DataFrame({
    'Age' : x_train['Age'] , 
    'Age_trf': x_train_trf[:,0],
    'Fare' : x_train['Fare'],
    'Fare_trf' : x_train_trf[: , 1]
})

In [24]:
output

          Age  Age_trf      Fare  Fare_trf
88   30.27259      8.0    7.7500       2.0
155  24.00000      4.0    7.5500       1.0
32   33.00000      9.0   20.5750       8.0
22   30.27259      8.0   31.6833      11.0
396  24.00000      4.0    7.2500       1.0
..        ...      ...       ...       ...
10   30.27259      8.0    7.8958       3.0
312  30.27259      8.0    7.5750       1.0
380  30.27259      8.0    7.7500       2.0
64   13.00000      1.0  262.3750      14.0
207  24.00000      4.0   10.5000       5.0

[334 rows x 4 columns]

In [26]:
output['Age_labels'] = pd.cut(x = x_train['Age'] , 
                              bins = trf.named_transformers_['first'].bin_edges_[0].tolist())


output['Fare_labels'] = pd.cut(x = x_train['Fare'] , 
                              bins = trf.named_transformers_['second'].bin_edges_[0].tolist())

In [27]:
output

          Age  Age_trf      Fare  Fare_trf      Age_labels         Fare_labels
88   30.27259      8.0    7.7500       2.0  (30.0, 30.273]       (7.229, 7.75]
155  24.00000      4.0    7.5500       1.0    (22.9, 25.0]       (7.229, 7.75]
32   33.00000      9.0   20.5750       8.0  (30.273, 33.0]    (15.677, 21.679]
22   30.27259      8.0   31.6833      11.0  (30.0, 30.273]      (29.86, 46.06]
396  24.00000      4.0    7.2500       1.0    (22.9, 25.0]       (7.229, 7.75]
..        ...      ...       ...       ...             ...                 ...
10   30.27259      8.0    7.8958       3.0  (30.0, 30.273]      (7.854, 7.925]
312  30.27259      8.0    7.5750       1.0  (30.0, 30.273]       (7.229, 7.75]
380  30.27259      8.0    7.7500       2.0  (30.0, 30.273]       (7.229, 7.75]
64   13.00000      1.0  262.3750      14.0    (0.17, 13.0]  (108.405, 512.329]
207  24.00000      4.0   10.5000       5.0    (22.9, 25.0]       (8.713, 12.3]

[334 rows x 6 columns]

In [29]:
x_train

          Age      Fare
88   30.27259    7.7500
155  24.00000    7.5500
32   33.00000   20.5750
22   30.27259   31.6833
396  24.00000    7.2500
..        ...       ...
10   30.27259    7.8958
312  30.27259    7.5750
380  30.27259    7.7500
64   13.00000  262.3750
207  24.00000   10.5000

[334 rows x 2 columns]